# Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/autoupdate"

#1password
tap "1password/tap"
tap "hashicorp/tap"
cask "1password-cli"

#Chezmoi
brew "chezmoi"

#Standard tools

brew "jq"
brew "openssh"
brew "sipcalc"
brew "wget"
brew "yq"
cask "font-hack-nerd-font"
cask "iterm2"
cask "visual-studio-code"
cask "adobe-acrobat-reader"
cask "amazon-chime"
cask "firefox"
cask "notion"
cask "textual"
#cask "microsoft-office"
cask "slack"
cask "spotify"
cask "alfred"
cask "gitkraken"
#brew "gitleaks"
cask "macdown"
cask "insomnia"
cask "expressions"
brew "thefuck"

#Shell
brew "starship"
brew "zsh"
brew "zsh-autosuggestions"
brew "fish"
brew "fisher"



#Software development
brew "glib"
brew "python"
brew "node"
brew "go"
brew "gobject-introspection"
brew "cookiecutter"
brew "pre-commit"
brew "git"
brew "golangci-lint"

#Security
brew "sops"
brew "age"
brew "age-plugin-yubikey"
brew "yubikey-agent"




#hcloud
brew "hcloud"

#Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "kubectl"
brew "docker"
brew "kind"


#Terraform
brew "terraform"
brew "cdktf"
brew "terragrunt"
brew "hashicorp/tap/terraform-ls"





cask "font-hack-nerd-font"
cask "hyper"
cask "iterm2"
cask "macdown"
cask "typora"
cask "visual-studio-code"
cask "wkhtmltopdf"
